Repository: Bigua/python-guide-pt_br
Catalog: docs/locale/*/LC_MESSAGES/intro/duction.po
Languages: pt_br

source: Introduction
pt_br: Introdução

source: From the `official Python website <http://python.org/about/>`_:
pt_br: Baseado no 'site oficial do Python <http://python.org/about/>'_:

source: Python is a general-purpose, high-level programming language similar to Tcl, Perl, Ruby, Scheme, or Java. Some of its main key features include:
pt_br: Python é uma linguagem de propósito geral e de alto nível, similar ao Perl, Tcl, Scheme ou Java. Algumas de umas funções principais incluem:

source: **very clear, readable syntax**
pt_br: **sintaxe muito clara e legível**

source: Python's philosophy focuses on readability, from code blocks delineated with significant whitespace to intuitive keywords in place of inscrutable punctuation.
pt_br: A filosofia do Python foca na facilidade de leitura, desde blocos de códigos delineados com significativos espaços em branco até palavras-chave intuitivas no lugar de pontuação ilegível.

source: **extensive standard libraries and third party modules for virtually any task**
pt_br: **Extensas bibliotecas padrão e módulos de terceiros para virtualizar qualquer tarefa**

source: Python is sometimes described with the words "batteries included" because of its extensive `standard library <http://docs.python.org/library/>`_, which includes modules for regular expressions, file IO, fraction handling, object serialization, and much more.
pt_br: Python é, às vezes, descrito com as palavras ''baterias inclusas'' devido suas extensas `bibliotecas padrão <http://docs.python.org/library/>`_, as quais incluem módulos para expressões regulares, I/O de arquivos, manipulação de frações, serialização de objetos, e muito mais.

source: Additionally, the `Python Package Index <http://pypi.python.org/pypi/>`_ is available for users to submit their packages for widespread use, similar to Perl's `CPAN <http://www.cpan.org>`_. There is a thriving community of very powerful Python frameworks and tools like the `Django <http://www.djangoproject.com>`_ web framework and the `NumPy <http://numpy.scipy.org>`_ set of math routines.
pt_br: Adicionalmente, o `Índice de Pacotes Python <http://pypi.python.org/pypi/>`_ está disponível para que os usuários submetam seus pacotes para difundir seu uso, de forma similar ao `CPAN do Perl <http://www.cpan.org>`_. Existe uma próspera comunidade de frameworks em Python muito poderosos, como o framework web `Django <http://www.djangoproject.com>`_ e o conjunto de rotinas matemáticas `NumPy <http://numpy.scipy.org>`_.

source: **integration with other systems**
pt_br: **Integração com outros sistemas**

source: Python can integrate with `Java libraries <http://www.jython.org>`_, enabling it to be used with the rich Java environment that corporate programmers are used to. It can also be `extended by C or C++ modules <http://docs.python.org/extending/>`_ when speed is of the essence.
pt_br: Python pode ser integrado com `bibliotecas Java <http://www.jython.org>`_, ativando-o para ser utilizado com os ricos ambientes em Java que programadores corporativos estão acostumados. Pode também ser estendido por módulos C ou C++ <http://docs.python.org/extending/>`_ quando a velocidade é essencial.

source: **ubiquity on computers**
pt_br: **Ubiquidade em computadores**

source: Python is available on Windows, \*nix, and Mac. It runs wherever the Java virtual machine runs, and the reference implementation CPython can help bring Python to wherever there is a working C compiler.
pt_br: Python está disponível no Windows, \*nix e Mac. Ele roda em qualquer lugar que uma máquina virtual do Java roda, e a implementação referencial CPython ajuda a trazer o Python a qualquer lugar em que haja um compilador C.

source: **friendly community**
pt_br: Comunidade amigável

source: Python has a vibrant and large :ref:`community <the-community>` which maintains wikis, conferences, countless repositories, mailing lists, IRC channels, and so much more. Heck, the Python community is even helping to write this guide!
pt_br: Python possui uma vibrante e grande :ref:`comunidade <the-community>` que mantém wikis, conferências, incontáveis repositórios, mailing lists, canais IRC, e muito mais. Caramba, a comunidade Python está ajudando até mesmo na escrita desse guia!

source: About This Guide
pt_br: Sobre este guia

source: Purpose
pt_br: Propósito

source: The Hitchhiker's Guide to Python exists to provide both novice and expert Python developers a best practice handbook for the installation, configuration, and usage of Python on a daily basis.
pt_br: O guia dos Mochileiros de Python existe para disponibilizar, para desenvolvedores novos e experientes em Python, um manual de boas práticas para a instalação, configuração e uso de Python em uma base diária.

source: By the Community
pt_br: Pela comunidade

source: This guide is architected and maintained by `Kenneth Reitz <https://github.com/kennethreitz>`_ in an open fashion. This is a community-driven effort that serves one purpose: to serve the community.
pt_br: Esse guia é arquitetado e mantido por `Kenneth Reitz <https://github.com/kennethreitz>`_ de uma forma aberta. Esse é um esforço dirigido à comunidade que serve a um propósito: servir a comunidade.

source: For the Community
pt_br: Para a comunidade

source: All contributions to the Guide are welcome, from Pythonistas of all levels. If you think there's a gap in what the Guide covers, fork the Guide on GitHub and submit a pull request.
pt_br: Todas as contribuições para o Guia são bem-vindas, de Pythonistas de todos os níveis. Se você acha que existe uma lacuna no que é coberto pelo Guia, faça um fork do Guia no GitHub e submeta um pull request.

source: Contributions are welcome from everyone, whether they're an old hand or a first-time Pythonista, and the authors to the Guide will gladly help if you have any questions about the appropriateness, completeness, or accuracy of a contribution.
pt_br: Contribuições são bem-vindas por todos, mesmo Pythonistas de longa data ou de primeira viagem, os autores do Guia irão ajudar, com prazer, caso você tenha qualquer questão sobre adequação, integridade, ou acurácia de uma contribuição.

source: To get started working on The Hitchhiker's Guide, see the :doc:`/notes/contribute` page.
pt_br: Para começar a trabalhar com o Guia dos Mochileiros de Python, veja a página :doc:`/notes/contribute`.
